README.org
#+title: Emacs configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :results output silent

* About

My very own Emacs configuration. Based on [[https://github.com/daviwil/emacs-from-scratch][Emacs from scratch]], customised to what I actually need.

I keep some comments in the Emacs Lisp snippets, as well as comments in the org file, so that the init.el file is easier to navigate.

Instructions on how to set Caps Lock to act as Control are [[https://support.apple.com/en-gb/guide/mac-help/mchlp1011/mac][here]]. Remember to do this for each machine and each connected keyboard!

Some of the things I want to do with my configuration:

- [X] Rename org files
- [X] Fix org-mode capture
- [X] Org mode changes
  - Bullets
  - Ellypsis
- [X] Rainbow delimiters
- [X] Use Org Babel to document Emacs config
- [X] Ivy + ivy-rich + which-key + counsel + helpful
- [X] Shell mode
- [X] dad-joke
- [X] Prescient
- [X] Homebrew
- [X] Configure list-buffers
- [X] Replace tasks and projects with actions
- [X] Make counsel-find-file not show ./ and ../
- [X] Replace lsp-mode with eglot
- [X] imenu
- [X] Beancount mode
- [ ] Look into org tags for quick win tasks
- [ ] org-gcal
- [ ] org-present
- [ ] Roam
- [ ] Look into ag + something? as a replacement for rgrep/wgrep
- [ ] Tune gc cons threshold
- [X] Capture notes for a future meeting
- [ ] gnu-elpa-keyring-update
- [X] Figure out how to force tramp to use my ~/.ssh/config
- [ ] Learn more about lexical binding in ELisp
- [X] Figure out how I used to use org and beancount modes simultaneously
  Added a hook to use outline-minor-mode with beancount mode. Beancount files should not have headers specifying modes.
- Language-specific features
  - [ ] Java mode
  - [ ] Python mode
    Currently, the pyright server doesn't start. It's trying to install something to do with nodeenv, which is a node.js thing. Python development isn't a huge priority at the moment, and I already have syntax highlighting from python mode, so I'll postpone installing node things just to use eglot with python.
  - [ ] Protobuf mode
  - [ ] LaTeX mode
  - [ ] gopls optimisations
    Have a look through the [options available in gopls](https://github.com/golang/tools/blob/master/gopls/doc/emacs.md).

* Start

#+begin_src emacs-lisp
  ;; _____________________________________________________________________________
  ;; Start loading config
  ;; _____________________________________________________________________________

  (toggle-debug-on-error)

  (switch-to-buffer "*Messages*")
  (message "Started loading config at %s" (format-time-string "%T"))

#+end_src

* Package management

- Set up the MELPA archive.
- Make sure that use-package is installed, so that it can be used to install all the other packages.
- Always ensure packages to avoid confusion over what is or isn't installed.

#+begin_src emacs-lisp
  ;; _____________________________________________________________________________
  ;; Package management
  ;; _____________________________________________________________________________

  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)

  (package-initialize)

  (unless package-archive-contents
   (package-refresh-contents))

  (unless (package-installed-p 'use-package)
     (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

#+end_src

* Global configuration

Run `M-x all-the-icons-install-fonts` to actually install icons.

#+begin_src emacs-lisp
  ;; _____________________________________________________________________________
  ;; Global configuration
  ;; _____________________________________________________________________________

  (setq inhibit-startup-message t)

  ;; Make it easier to access emacs config
  (set-register ?e (cons 'file "~/.emacs.d/README.org"))

  ;; Easy commenting
  (global-set-key (kbd "M-/") 'comment-or-uncomment-region)

  ;; Cycle through buffers easily
  (global-set-key (kbd "s-<left>") 'previous-buffer)
  (global-set-key (kbd "s-<right>") 'next-buffer)

  ;; Cycle through windows easily
  (global-set-key (kbd "C-<tab>") 'other-window)
  (defun switch-to-prev-window ()
    (interactive)
    (other-window -1))
  (global-set-key (kbd "C-S-<tab>") 'switch-to-prev-window)

  ;; Simplify yes-or-no prompts
  (defalias 'yes-or-no-p 'y-or-n-p)

  ;; Make the right option key not act as meta, to let me type characters that need option
  (setq ns-right-alternate-modifier 'none)

  ;; Theme and display configuration
  (load-theme 'tango-dark t)
  (column-number-mode)
  (global-display-line-numbers-mode)
  (global-visual-line-mode)

  ;; Icons that can be used by several packages
  (use-package all-the-icons)

  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom
    (doom-modeline-buffer-encoding nil)
    (doom-modeline-minor-modes t))

  ;; Natural language formatting and spelling
  (setq sentence-end-double-space nil)
  (setq ispell-program-name "/opt/homebrew/bin/ispell")
  (dolist (hook '(text-mode-hook))
    (add-hook hook (lambda () (flyspell-mode 1))))

#+end_src

* Silly things

Everything else in this configuration serves a purpose. The packages in this section are just for fun. They'll be the first to be sacrificed when Emacs inevitable devours all my memory.

#+begin_src emacs-lisp
  (use-package nyan-mode
    :config (nyan-mode 1))

  (use-package dad-joke)

#+end_src

* Completion

** which-key

When typing a key bind prefix, WK mode expands the minibuffer to display commands under that prefix.

#+begin_src emacs-lisp
  (use-package which-key
    :config
    (which-key-mode)
    (setq which-key-idle-delay 0.5))

#+end_src

** Ivy

Ivy provides completion functions for all interactive functions that require input, such as find-file and switch-buffer.

#+begin_src emacs-lisp
  (use-package ivy
    :demand
    :bind (:map ivy-minibuffer-map
		("TAB" . ivy-alt-done))
    :config
    (setq ivy-initial-inputs-alist nil)
    (ivy-mode 1))

  ;; Stop ./ and ../ from showing up in filepath completions
  (setq ivy-extra-directories nil)
#+end_src

** Swiper

A better version of isearch to fuzzy search in a file.

#+begin_src emacs-lisp
  (use-package swiper
    :demand
    :bind ("C-s" . swiper))
#+end_src

** Counsel

Replaces some common functions with versions that are easier to integrate with Ivy and other packages.

`ivy-rich` provides a better UI for counsel.

#+begin_src emacs-lisp
  (use-package counsel
    :config (counsel-mode 1)
    :bind ("C-c i" . counsel-imenu))

  (use-package ivy-rich
    :config
    (ivy-rich-mode 1))

#+end_src

** Prescient

Sorts completions by recently used and most used, instead of the default sorting order.

#+begin_src emacs-lisp
  (use-package ivy-prescient
    :custom
    (ivy-prescient-enable-filtering nil)
    :config
    (prescient-persist-mode 1)
    (ivy-prescient-mode 1))

#+end_src

** Company

- Text completion for source code and natural language.

#+begin_src emacs-lisp
  (use-package company
    :hook ((prog-mode text-mode) . company-mode)
    :config
    (setq company-idle-delay 0)
    (setq company-minimum-prefix-length 1))

  (use-package company-prescient
    :after company
    :config
    (company-prescient-mode 1))
#+end_src

** Helpful

This helpful package replaces the default help functions with ones that provide more information, such as source code snippets.

The functions to describe functions and variables are passed through the counsel commands so that they have completion using counsel and ivy-rich, rather than just Ivy.

#+begin_src emacs-lisp
  (use-package helpful
    :commands (helpful-callable helpful-variable helpful-command helpful-key)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

* Better built-ins

** Dired

- Run `brew install coreutils` on MacOS to get gls, which supports the `--group-directories-first` option.
- Toggle dired omit mode with "C-x M-o". This mode hides "uninteresting" files such as backup and dot files. This is better than hiding files through options passed to the ls command because it lets me quickly toggle the mode when I need to look at dot files, for example.

#+begin_src emacs-lisp
  ;; _____________________________________________________________________________
  ;; Dired
  ;; _____________________________________________________________________________

  (use-package dired
    :ensure nil
    :hook (dired-mode . dired-omit-mode)
    :custom ((dired-listing-switches "-lah --group-directories-first"))
    :config
    (require 'dired-x)
    (setq dired-omit-files (concat dired-omit-files "\\|^\\..+$"))
    (setq insert-directory-program "gls"))

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

#+end_src

