init.el
;; _____________________________________________________________________________
;; Start loading config
;; _____________________________________________________________________________

(toggle-debug-on-error)

(switch-to-buffer "*Messages*")
(message "Started loading config at %s" (format-time-string "%T"))

;; _____________________________________________________________________________
;; Package management
;; _____________________________________________________________________________

(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)

(package-initialize)

(unless package-archive-contents
 (package-refresh-contents))

(unless (package-installed-p 'use-package)
   (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

;; _____________________________________________________________________________
;; Global configuration
;; _____________________________________________________________________________

(setq inhibit-startup-message t)

;; Make it easier to access emacs config
(set-register ?e (cons 'file "~/.emacs.d/README.org"))

;; Easy commenting
(global-set-key (kbd "M-/") 'comment-or-uncomment-region)

;; Cycle through buffers easily
(global-set-key (kbd "s-<left>") 'previous-buffer)
(global-set-key (kbd "s-<right>") 'next-buffer)

;; Cycle through windows easily
(global-set-key (kbd "C-<tab>") 'other-window)
(defun switch-to-prev-window ()
  (interactive)
  (other-window -1))
(global-set-key (kbd "C-S-<tab>") 'switch-to-prev-window)

;; Simplify yes-or-no prompts
(defalias 'yes-or-no-p 'y-or-n-p)

;; Make the right option key not act as meta, to let me type characters that need option
(setq ns-right-alternate-modifier 'none)

;; Theme and display configuration
(load-theme 'tango-dark t)
(column-number-mode)
(global-display-line-numbers-mode)
(global-visual-line-mode)

;; Icons that can be used by several packages
(use-package all-the-icons)

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom
  (doom-modeline-buffer-encoding nil)
  (doom-modeline-minor-modes t))

;; Natural language formatting and spelling
(setq sentence-end-double-space nil)
(setq ispell-program-name "/opt/homebrew/bin/ispell")
(dolist (hook '(text-mode-hook))
  (add-hook hook (lambda () (flyspell-mode 1))))

(use-package nyan-mode
  :config (nyan-mode 1))

(use-package dad-joke)

(use-package which-key
  :config
  (which-key-mode)
  (setq which-key-idle-delay 0.5))

(use-package ivy
  :demand
  :bind (:map ivy-minibuffer-map
	      ("TAB" . ivy-alt-done))
  :config
  (setq ivy-initial-inputs-alist nil)
  (ivy-mode 1))

;; Stop ./ and ../ from showing up in filepath completions
(setq ivy-extra-directories nil)

(use-package swiper
  :demand
  :bind ("C-s" . swiper))

(use-package counsel
  :config (counsel-mode 1)
  :bind ("C-c i" . counsel-imenu))

(use-package ivy-rich
  :config
  (ivy-rich-mode 1))

(use-package ivy-prescient
  :custom
  (ivy-prescient-enable-filtering nil)
  :config
  (prescient-persist-mode 1)
  (ivy-prescient-mode 1))

(use-package company
  :hook ((prog-mode text-mode) . company-mode)
  :config
  (setq company-idle-delay 0)
  (setq company-minimum-prefix-length 1))

(use-package company-prescient
  :after company
  :config
  (company-prescient-mode 1))

(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

;; _____________________________________________________________________________
;; Dired
;; _____________________________________________________________________________

(use-package dired
  :ensure nil
  :hook (dired-mode . dired-omit-mode)
  :custom ((dired-listing-switches "-lah --group-directories-first"))
  :config
  (require 'dired-x)
  (setq dired-omit-files (concat dired-omit-files "\\|^\\..+$"))
  (setq insert-directory-program "gls"))

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))

;; _____________________________________________________________________________
;; IBuffer
;; _____________________________________________________________________________
