README.org
** IBuffer

- Replace `list-buffers` the more powerful built-in `ibuffer`.
- Group buffers by type, and make it easier to collapse groups.

#+begin_src emacs-lisp
  ;; _____________________________________________________________________________
  ;; IBuffer
  ;; _____________________________________________________________________________

  (require 'ibuffer)
  (global-set-key (kbd "C-x C-b") 'ibuffer)
  (setq ibuffer-saved-filter-groups
	(quote (("default"
		 ("Side effects" (or
				  (derived-mode . helpful-mode)
				  (and
				   (name . "^\\*")
				   (size-lt . 1))))
		 ("Dired" (mode . dired-mode))
		 ("Org" (mode . org-mode))
		 ("Source code" (or
				 (derived-mode . prog-mode)
				 (derived-mode . protobuf-mode)))
		 ("Version control" (derived-mode . magit-section-mode))))))

  (add-hook 'ibuffer-mode-hook
	    (lambda () (ibuffer-switch-to-saved-filter-groups "default")))

  (setq ibuffer-default-sorting-mode 'filename/process)

  (setq ibuffer-fontification-alist
	'((100 (eq major-mode 'java-mode) magit-process-ng)
	  (10 buffer-read-only font-lock-constant-face)
	  (15 (and buffer-file-name
		   (string-match ibuffer-compressed-file-name-regexp
				 buffer-file-name))
	      font-lock-doc-face)
	  (20 (string-match "^\\*" (buffer-name)) font-lock-keyword-face)
	  (25 (and (string-match "^ " (buffer-name))
		   (null buffer-file-name))
	      italic)
	  (30 (memq major-mode ibuffer-help-buffer-modes) font-lock-comment-face)
	  (35 (derived-mode-p 'dired-mode) font-lock-function-name-face)
	  (40 (and (boundp 'emacs-lock-mode) emacs-lock-mode) ibuffer-locked-buffer)))

  (defun nrm/ibuffer-toggle-current-group()
    (interactive)
    (ibuffer-forward-filter-group)
    (ibuffer-backward-filter-group)
    (ibuffer-toggle-filter-group))

  (define-key ibuffer-mode-map (kbd "<tab>") 'nrm/ibuffer-toggle-current-group)

#+end_src

** wgrep

- Writable grep results.

#+begin_src emacs-lisp
  ;; _____________________________________________________________________________
  ;; IBuffer
  ;; _____________________________________________________________________________

  (use-package wgrep)

#+end_src

* Magit

#+begin_src emacs-lisp
  ;; _____________________________________________________________________________
  ;; Magit
  ;; _____________________________________________________________________________

  (use-package magit
    :custom
    (magit-display-buffer-function #'magit-display-buffer-fullframe-status-v1)
    :bind ("C-x g" . magit-status))

#+end_src

* Org

** org-mode and UI

Configuration that I want to apply to every Org buffer by default.

Actions can be in one of the following states, according to the GTD method:
- SCOPE: I want to do something about this, but I haven't decided what. I need to spend some time figuring out what I need to do, if anything.
- BACKLOG: I have identified there is something I want to do/process, but it isn't urgent. It is noted down for later.
- TODO: I have something to do, and I know exactly what it is. This task is ready to be worked on, as soon as I decide to pick it up.
- WAIT: This task is blocked on something, such as receiving an email response. I should check in every once in a while, but there is nothing I can currently do about it.
- REVIEW: I have finished this task, and I should spend some time writing a mini-debrief about it with any notes I want to keep, as well as any next actions.
- DONE: This task is done, reviewed, and archived somewhere.
- CANCELLED: I decided not to do this task.

#+begin_src emacs-lisp
  ;; _____________________________________________________________________________
  ;; Org
  ;; _____________________________________________________________________________

  (use-package org
    :bind
    ("\C-cl" . org-store-link)
    ("s-a" . org-agenda)
    ("s-c" . org-capture)
    :custom
    (org-ellipsis " ▾")
    (org-todo-keywords '((sequence "SCOPE(s)" "BACKLOG(b)" "TODO(t)" "WAIT(w)" "REVIEW(r)" "|" "DONE(d)" "CANCELLED(c)")))
    ;; Record the date but not the time of day when a todo item is done
    (org-log-done 'time)
    (org-log-done-with-time nil)
    (org-log-into-drawer t)
    ;; Allow items to be refiled to the top level in a file, rather than under another headline
    (org-refile-use-outline-path 'file)
    ;; Show file and headline paths in the refile completion buffer
    (org-outline-path-complete-in-steps nil)
    ;; Refile targets to the top of files and headlines, rather than the end
    (org-reverse-note-order t)
    ;; Display done items with their completion date
    (org-agenda-start-with-log-mode t)
    (org-agenda-log-mode-items '(closed clock state))
    (org-agenda-window-setup "current-window")
    ;; If an entry has a TODO label, don't check its children
    (org-agenda-todo-list-sublevels nil)
    :config
    (advice-add 'org-refile :after 'org-save-all-org-buffers))

  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

** Babel

How meta!

- Automatically tangle this file on save to generate init.el.
- Don't ask for permission to run code in org babel.
- Make it easier to insert code snippets.

#+begin_src emacs-lisp
  ;; _____________________________________________________________________________
  ;; Babel
  ;; _____________________________________________________________________________

  ;; Automatically tangle the README.org file on save
  (defun nrm/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
			(expand-file-name "~/.emacs.d/README.org"))
      (org-babel-tangle)))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'nrm/org-babel-tangle-config)))

  (setq org-confirm-babel-evaluate nil)

  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))

#+end_src

** Roam

Roam needs a C/C++ compiler to generate the required database.

To make a header in a file into its own node, run `org-id-get-create`.

#+begin_src emacs-lisp
  ;; _____________________________________________________________________________
  ;; Roam
  ;; _____________________________________________________________________________

  (use-package org-roam
    :demand
    :custom
    (org-roam-directory "~/brain")
    (org-roam-capture-templates
     '(("t" "Topic" plain
	"%?"
	:target (file+head "roam-${slug}.org" "#+title: ${title}\n#+filetags: Topic\n#+date: %U")
	:unnarrowed t)
       ("a" "Action" plain
	"* Goals\n%?\n* Actions\n"
	:target (file+head "roam-${slug}.org" "#+title: ${title}\n#+filetags: Actions AgendaSource\n#+date: %U")
	:unnarrowed t)
       ("p" "Person" plain
	"%?"
	:target (file+head "roam-${slug}.org" "#+title: ${title}\n#+filetags: Person\n#+date: %U")
	:unnarrowed t)
       ("b" "Book" plain
	"- Author: %?\n- Notes: \n\n* Summary\n\n* Chapters\n\n* Comments\n"
	:target (file+head "roam-${slug}.org" "#+title: ${title}\n#+filetags: Book\n#+date: %U")
	:unnarrowed t)
       ("l" "Location" plain
	"* Comments\n%?\n* Visits\n\n* Ice cream\n\n* Restaurants\n\n* Points of interest\n"
	:target (file+head "roam-${slug}.org" "#+title: ${title}\n#+filetags: Location\n#+date: %U")
	:unnarrowed t)))
    :bind (("s-r" . org-roam-node-find)
	   :map org-mode-map
	   ("C-c i" . org-roam-node-insert)
	   ("C-c b" . org-roam-buffer-toggle))
    :config
    (org-roam-db-autosync-enable))

  (defun nrm/roam-list-files-with-tag (tag-name)
    (mapcar #'org-roam-node-file
	    (seq-filter
	     (lambda (elt) (member tag-name (org-roam-node-tags elt)))
	     (org-roam-node-list))))

  (setq org-agenda-files (nrm/roam-list-files-with-tag "Test"))

#+end_src

** File structure

- All org files used in my gtd setup are in the same directory.
- Tasks and projects are stored in the actions file.
- The inbox file is used to quickly capture ideas of things I should do without interrupting my focus.
- The rar and media files are used to keep personal notes.
- I want to easily move org entries between files, but not into the inbox file. The only way into the inbox file should be through capture, and entries in the inbox file should be moved to the appropriate place once I process them.
- Save all org buffers after refiling, to prevent entries being lost if Emacs crashes.

#+begin_src emacs-lisp
  ;; File structure
  (setq org-directory "~/gtd")
  (set-register ?g (cons 'file (concat org-directory "/actions.org")))

  (add-to-list 'org-agenda-files "inbox.org")
  (add-to-list 'org-agenda-files "meetings.org")
  (add-to-list 'org-agenda-files "actions.org")

  (setq org-refile-targets
	'(("actions.org" :maxlevel . 3)
	  ("rar.org" :maxlevel . 1)
	  ("media.org" :maxlevel . 1)
	  ("meetings.org" :maxlevel . 1)))

#+end_src

** Capture templates

- As mentioned above, quickly capture ideas into the inbox file, to be processed later.
- Also, quickly start taking meeting notes, organised in a file sorted by date.

To quickly jump to the last captured entry, call `bookmark-jump org-capture-last-stored`, which is bound to "C-x r b".

#+begin_src emacs-lisp
  (setq org-capture-templates
      `(("t" "Task" entry (file "inbox.org")
	 "* SCOPE %?\n%U\n%a" :prepend t)
	("m" "Meeting notes" entry (file "meetings.org")
	 "* REVIEW %?\n%t" :prepend t)))

#+end_src

