init.el

(require 'ibuffer)
(global-set-key (kbd "C-x C-b") 'ibuffer)
(setq ibuffer-saved-filter-groups
      (quote (("default"
	       ("Side effects" (or
				(derived-mode . helpful-mode)
				(and
				 (name . "^\\*")
				 (size-lt . 1))))
	       ("Dired" (mode . dired-mode))
	       ("Org" (mode . org-mode))
	       ("Source code" (or
			       (derived-mode . prog-mode)
			       (derived-mode . protobuf-mode)))
	       ("Version control" (derived-mode . magit-section-mode))))))

(add-hook 'ibuffer-mode-hook
	  (lambda () (ibuffer-switch-to-saved-filter-groups "default")))

(setq ibuffer-default-sorting-mode 'filename/process)

(setq ibuffer-fontification-alist
      '((100 (eq major-mode 'java-mode) magit-process-ng)
	(10 buffer-read-only font-lock-constant-face)
	(15 (and buffer-file-name
		 (string-match ibuffer-compressed-file-name-regexp
			       buffer-file-name))
	    font-lock-doc-face)
	(20 (string-match "^\\*" (buffer-name)) font-lock-keyword-face)
	(25 (and (string-match "^ " (buffer-name))
		 (null buffer-file-name))
	    italic)
	(30 (memq major-mode ibuffer-help-buffer-modes) font-lock-comment-face)
	(35 (derived-mode-p 'dired-mode) font-lock-function-name-face)
	(40 (and (boundp 'emacs-lock-mode) emacs-lock-mode) ibuffer-locked-buffer)))

(defun nrm/ibuffer-toggle-current-group()
  (interactive)
  (ibuffer-forward-filter-group)
  (ibuffer-backward-filter-group)
  (ibuffer-toggle-filter-group))

(define-key ibuffer-mode-map (kbd "<tab>") 'nrm/ibuffer-toggle-current-group)

;; _____________________________________________________________________________
;; IBuffer
;; _____________________________________________________________________________

(use-package wgrep)

;; _____________________________________________________________________________
;; Magit
;; _____________________________________________________________________________

(use-package magit
  :custom
  (magit-display-buffer-function #'magit-display-buffer-fullframe-status-v1)
  :bind ("C-x g" . magit-status))

;; _____________________________________________________________________________
;; Org
;; _____________________________________________________________________________

(use-package org
  :bind
  ("\C-cl" . org-store-link)
  ("s-a" . org-agenda)
  ("s-c" . org-capture)
  :config
  (setq org-ellipsis " ▾"))

(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

;; _____________________________________________________________________________
;; Babel
;; _____________________________________________________________________________

;; Automatically tangle the README.org file on save
(defun nrm/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
		      (expand-file-name "~/.emacs.d/README.org"))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'nrm/org-babel-tangle-config)))

(setq org-confirm-babel-evaluate nil)

(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("sh" . "src shell"))

;; Workflow states
(setq org-todo-keywords
      '((sequence "SCOPE(s)" "BACKLOG(b)" "TODO(t)" "WAIT(w)" "REVIEW(r)" "|" "DONE(d)" "CANCELLED(c)")))

(setq org-log-done 'time)
(setq org-log-into-drawer t)

;; File structure
(setq org-directory "~/gtd")
(set-register ?g (cons 'file (concat org-directory "/actions.org")))

(setq org-agenda-files
      '("inbox.org"
	"meetings.org"
	"actions.org"))

;; Allow hadlines to be refiled to top level in a file, rather than under another headline
(setq org-refile-use-outline-path 'file)
;; Show file and headline paths in the refile completion buffer
(setq org-outline-path-complete-in-steps nil)
;; Refile targets to the top of files and headlines, rather than the end
(setq org-reverse-note-order t)

(setq org-refile-targets
      '(("actions.org" :maxlevel . 1)
	("rar.org" :maxlevel . 1)
	("media.org" :maxlevel . 1)
	("meetings.org" :maxlevel . 1)))

(advice-add 'org-refile :after 'org-save-all-org-buffers)

(setq org-capture-templates
    `(("t" "Task" entry (file "inbox.org")
       "* SCOPE %?\n%U\n%a" :prepend t)
      ("m" "Meeting notes" entry (file "meetings.org")
       "* REVIEW %?\n%t" :prepend t)))
